package com.teachmeskills.lesson3.HW;
/*
Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.
 */
public class Homework4 {
    public static void main(String[] args) {
        for (int i=10; i<=20; i++){
            System.out.println(i*i);
        }
    }
}
