package com.teachmeskills.lesson3.HW;

/* Создать класс.
В методе main объявить переменную типа double и присвоить ей произвольные числовые значения.
Сделать явное приведение переменной к типу int.
Результат вывести на консоль.
*/

public class Homework0 {
    public static void main(String[] args) {
        double A = 169423;
        int B = (int) A;
        System.out.println(B);
    }
}
