package com.teachmeskills.lesson3.HW;
/*
В методе main объявить две переменные.
Первую переменную объявить типом char и присвоить значение 1, вторую переменную объявить типом int и присвоить значение 1.
Вывести на консоль результат первая переменная + вторая переменная.
Подумать над полученным результатом.
 */
public class Homework1 {
    public static void main(String[] args) {
        char a = 1;
        int b = 1;
        System.out.println(a+b);
    }
}

/*
Результат 2 в ходе сложения (присваивания) получился в ходе автоматического (неявного преобразования)
 */
